       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           01 WS-TABLE.
               05 WS-NUM PIC 9(3) VALUE 10 OCCURS 10 TIMES.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "ARRAY", WS-TABLE.
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
