       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 VAR PIC 9(3) VALUE 123.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "O valor da variavel é :", VAR
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
